Revit 2027 API
GeometryElement.GetBoundingBox Method
Retrieves a box that encloses the geometry element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BoundingBoxXYZ GetBoundingBox()
Public Function GetBoundingBox As BoundingBoxXYZ
public:
BoundingBoxXYZ^ GetBoundingBox()
member GetBoundingBox : unit -> BoundingBoxXYZ
Return Value
BoundingBoxXYZ
The bounding box.
Remarks
Note: If the GeometryElement was obtained via Element.get_Geometry from an Element containing 2D geometry but no 3D geometry, the bounding box returned by this function may not be empty because it takes the 2D geometry into account.
See Also
Reference
GeometryElement Class
Autodesk.Revit.DB Namespace